tap "coderabbitai/tap"
tap "yun-sangho/tap"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Parser generator tool
brew "tree-sitter-cli"
# Git worktree manager with editor and AI tool integration
brew "coderabbitai/tap/git-gtr"
# Remove Adobe Digital Editions (Adept) DRM from EPUB/PDF files
brew "yun-sangho/tap/dedrm"
# Event-driven display sleep on lid close, even when sleep is blocked
brew "yun-sangho/tap/lidwatch"
# Cross-shell prompt for astronauts
brew "starship"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-cjk-kr"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
